FUNSKII55/-STM32-/Drone Project - 陀螺仪/Drone Project/Motor_DeviceDriver/Peripheral/mpu6050/mpu6050/inv_mpu.c
    if (st.chip_cfg.cache.dmp_on)
        mpu_set_dmp_state(1);

#ifdef MPU6500
    /* Disable motion interrupt (MPU6500 version). */
    data[0] = 0;
    if (i2c_write(st.hw->addr, st.reg->accel_intel, 1, data))
        goto lp_int_restore;
#endif

    st.chip_cfg.int_motion_only = 0;
    return 0;
}
//////////////////////////////////////////////////////////////////////////////////
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//ALIENTEK阿波罗STM32开发板V3
//MPU6050 DMP 驱动代码	   
//正点原子@ALIENTEK
//技术论坛:www.openedv.com
//创建日期:2015/1/17
//版本：V1.0
//版权所有，盗版必究
//Copyright(C) 广州市星翼电子科技有限公司 2009-2019
//All rights reserved									  
////////////////////////////////////////////////////////////////////////////////// 

//q30格式,long转float时的除数.
#define q30  1073741824.0f


#define MPU_IIC_Init MX_I2C2_Init

#define u8 uint8_t
#define u16 uint16_t

//陀螺仪方向矩阵
static signed char gyro_orientation[9] = { 1, 0, 0,
                                           0, 1, 0,
                                           0, 0, 1};
//MPU6050自检
//返回值:0,正常
//    其他,失败
u8 run_self_test(void)
{
	int result;
	//char test_packet[4] = {0};
	long gyro[3], accel[3]; 
	result = mpu_run_self_test(gyro, accel);
	if (result == 0x3) 
	{
		/* Test passed. We can trust the gyro data here, so let's push it down
		* to the DMP.
		*/
		float sens;
		unsigned short accel_sens;
		mpu_get_gyro_sens(&sens);
		gyro[0] = (long)(gyro[0] * sens);
		gyro[1] = (long)(gyro[1] * sens);
		gyro[2] = (long)(gyro[2] * sens);
		dmp_set_gyro_bias(gyro);
		mpu_get_accel_sens(&accel_sens);
		
		//accel_sens=0;//注释掉  防止零位小角度平衡，让MPU6050输出值为0  --zzw 2024.6.10
		
		
		accel[0] *= accel_sens;
		accel[1] *= accel_sens;
		accel[2] *= accel_sens;
		dmp_set_accel_bias(accel);
		return 0;
	}else return 1;
}
//陀螺仪方向矩阵
unsigned short inv_orientation_matrix_to_scalar(
    const signed char *mtx)
{
    unsigned short scalar; 
    /*
       XYZ  010_001_000 Identity Matrix
       XZY  001_010_000
       YXZ  010_000_001
       YZX  000_010_001
       ZXY  001_000_010
       ZYX  000_001_010
     */

    scalar = inv_row_2_scale(mtx);
    scalar |= inv_row_2_scale(mtx + 3) << 3;
    scalar |= inv_row_2_scale(mtx + 6) << 6;


    return scalar;
}
//矩阵转换
unsigned short inv_row_2_scale(const signed char *row)
{
    unsigned short b;

    if (row[0] > 0)
        b = 0;
    else if (row[0] < 0)
        b = 4;
    else if (row[1] > 0)
        b = 1;
    else if (row[1] < 0)
        b = 5;
    else if (row[2] > 0)
        b = 2;
    else if (row[2] < 0)
        b = 6;
    else
        b = 7;      // error
    return b;
}
//空函数,未用到.
void mget_ms(unsigned long *time)
{

}
//mpu6050,dmp初始化
//返回值:0,正常
//    其他,失败
u8 mpu_dmp_init(void)
{
	u8 res=0;
	MPU_IIC_Init(); 	//初始化IIC总线
	if(mpu_init()==0)	//初始化MPU6050
	{	 
		res=mpu_set_sensors(INV_XYZ_GYRO|INV_XYZ_ACCEL);//设置所需要的传感器
		if(res)return 1; 
		res=mpu_configure_fifo(INV_XYZ_GYRO|INV_XYZ_ACCEL);//设置FIFO
		if(res)return 2; 
		res=mpu_set_sample_rate(DEFAULT_MPU_HZ);	//设置采样率
		if(res)return 3; 
		res=dmp_load_motion_driver_firmware();		//加载dmp固件
		if(res)return 4; 
		res=dmp_set_orientation(inv_orientation_matrix_to_scalar(gyro_orientation));//设置陀螺仪方向矩阵
		if(res)return 5; 
		res=dmp_enable_feature(DMP_FEATURE_6X_LP_QUAT|DMP_FEATURE_TAP|	//设置dmp功能
		    DMP_FEATURE_ANDROID_ORIENT|DMP_FEATURE_SEND_RAW_ACCEL|DMP_FEATURE_SEND_CAL_GYRO|
		    DMP_FEATURE_GYRO_CAL);
		if(res)return 6; 
		res=dmp_set_fifo_rate(DEFAULT_MPU_HZ);	//设置DMP输出速率(最大不超过200Hz)
		if(res)return 7;   
		res=run_self_test();		//自检
		if(res)return 8;    
		res=mpu_set_dmp_state(1);	//使能DMP
		if(res)return 9;     
	}else return 10;
	return 0;
}
//得到dmp处理后的数据(注意,本函数需要比较多堆栈,局部变量有点多)
//pitch:俯仰角 精度:0.1°  范围:-90.0° <---> +90.0°
//roll:横滚角 精度:0.1°  范围:-180.0°<---> +180.0°
//yaw:航向角 精度:0.1°  范围:-180.0°<---> +180.0°
//返回值:0,正常
//    其他,失败
u8 mpu_dmp_get_data(float *pitch,float *roll,float *yaw)
{
	float q0=1.0f,q1=0.0f,q2=0.0f,q3=0.0f;
	unsigned long sensor_timestamp;
	short gyro[3], accel[3], sensors;
	unsigned char more;
	long quat[4]; 
	if(dmp_read_fifo(gyro, accel, quat, &sensor_timestamp, &sensors,&more))return 1;	 
	/* Gyro and accel data are written to the FIFO by the DMP in chip frame and hardware units.
	 * This behavior is convenient because it keeps the gyro and accel outputs of dmp_read_fifo and mpu_read_fifo consistent.
	**/
	/*if (sensors & INV_XYZ_GYRO )
	send_packet(PACKET_TYPE_GYRO, gyro);
	if (sensors & INV_XYZ_ACCEL)
	send_packet(PACKET_TYPE_ACCEL, accel); */
	/* Unlike gyro and accel, quaternions are written to the FIFO in the body frame, q30.
	 * The orientation is set by the scalar passed to dmp_set_orientation during initialization. 
	**/
	if(sensors&INV_WXYZ_QUAT) 
	{
		q0 = quat[0] / q30;	//q30格式转换为浮点数
		q1 = quat[1] / q30;
		q2 = quat[2] / q30;
		q3 = quat[3] / q30; 
		//计算得到俯仰角/横滚角/航向角
		*pitch = asin(-2 * q1 * q3 + 2 * q0* q2)* 57.3;	// pitch
		*roll  = atan2(2 * q2 * q3 + 2 * q0 * q1, -2 * q1 * q1 - 2 * q2* q2 + 1)* 57.3;	// roll
		*yaw   = atan2(2*(q1*q2 + q0*q3),q0*q0+q1*q1-q2*q2-q3*q3) * 57.3;	//yaw
	}else return 2;
	return 0;
}



/*User ADD 用户自定义添加*/
#define MPU_Addr 0xD0

static KalmanFilter_mpu6050 Kalman_Struct[3] = {{0.02,0,0,0,0.001,0.8},{0.02,0,0,0,0.001,0.8},{0.02,0,0,0,0.001,0.8}};

static volatile int16_t gyro_databuff[3]={0};//角速度数据暂存


void kalman_Filter_1(KalmanFilter_mpu6050 *ekf,float input)  //一维卡尔曼
{
	ekf->Now_P = ekf->LastP + ekf->Q;
	ekf->Kg = ekf->Now_P / (ekf->Now_P + ekf->R);
	ekf->out = ekf->out + ekf->Kg * (input - ekf->out);
	ekf->LastP = (1-ekf->Kg) * ekf->Now_P ;
}

void MPU6050_Init(void)
{
    int16_t t=0;
    int32_t buffer_gyro[3]={0};
    int32_t buffer_accel[3]={0};
    while(mpu_dmp_init()){
        HAL_Delay(200);
		printf("%s\r\n","Mpu6050_DMP Init Wrong!");
		printf("   %d",mpu_dmp_init());
    }
}

/*mpu6050校准值*/
static float calibration_value_angle[3]={0,0,0};//角度校准值
static int16_t calibration_value_gyro[3]={0,0,0};//角速度校准值
static float calibration_value_accel[3]={0,0,0};//角加速度校准值

u8 MPU_Get_Gyroscope(short *gx,short *gy,short *gz)
{
    
    volatile static short Gyro_t[3][10]={0};
    u8 buf[6],res; 
    short gx_t,gy_t,gz_t; 
	res=MPU_Read_Len(MPU_Addr,0X43,6,buf);
    #if 1
        if(res==0)
        {
            gx_t=((u16)buf[0]<<8)|buf[1];  
            gy_t=((u16)buf[2]<<8)|buf[3];  
            gz_t=((u16)buf[4]<<8)|buf[5];
        } 	
    #endif
    /*对角速度进行低通滤波*/
    #if 1
        static volatile short tbuf[3]={0};
        static volatile float filter_Param=0.25f;
        gx_t=tbuf[0]=(short)(gx_t*filter_Param+tbuf[0]*(1-filter_Param));
        gy_t=tbuf[1]=(short)(gy_t*filter_Param+tbuf[1]*(1-filter_Param));
        gz_t=tbuf[2]=(short)(gz_t*filter_Param+tbuf[2]*(1-filter_Param));
        *gx=gx_t-calibration_value_gyro[0];
        *gy=gy_t-calibration_value_gyro[1];
        *gz=gz_t-calibration_value_gyro[2];
    #endif

    return res;
}
//得到加速度值(原始值)
//范围:+-2G
//gx,gy,gz:陀螺仪x,y,z轴的原始读数(带符号)
//返回值:0,成功
//    其他,错误代码
u8 MPU_Get_Accelerometer(float *ax,float *ay,float *az)
{
    
    u8 buf[6],res;  
    static int16_t accel_databuff[3]={0};//角加速度数据暂存
	res=MPU_Read_Len(MPU_Addr,0X3B,6,buf);
    #if 1
        if(res==0)
        {
            accel_databuff[0] = (((int16_t)buf[0]<< 8) | buf[1]);//-calibration_value_accel[0];	
	        accel_databuff[1] = (((int16_t)buf[2]<< 8) | buf[3]);//-calibration_value_accel[1];			
	        accel_databuff[2] = (((int16_t)buf[4]<< 8) | buf[5]);//-calibration_value_accel[2];
        }
    
    #endif
    /*对加速度进行卡尔曼滤波*/
    #if 1
        kalman_Filter_1(&Kalman_Struct[0],(float)accel_databuff[0]);
        accel_databuff[0]=(int16_t)Kalman_Struct[0].out;
        kalman_Filter_1(&Kalman_Struct[1],(float)accel_databuff[1]);
        accel_databuff[1]=(int16_t)Kalman_Struct[1].out;
        kalman_Filter_1(&Kalman_Struct[2],(float)accel_databuff[2]);
        accel_databuff[2]=(int16_t)Kalman_Struct[2].out;
    #endif
    #if 1
        static float last_accel[3]={0};
        accel_databuff[0] = accel_databuff[0]*0.3 + last_accel[0]*0.7;
        accel_databuff[1] = accel_databuff[1]*0.3 + last_accel[1]*0.7;
        accel_databuff[2] = accel_databuff[2]*0.3 + last_accel[2]*0.7;
        last_accel[0] = accel_databuff[0];
        last_accel[1] = accel_databuff[1];
        last_accel[2] = accel_databuff[2];
    #endif
        *ax=(float)(accel_databuff[0]) - calibration_value_accel[0];
        *ay=(float)(accel_databuff[1]) - calibration_value_accel[1];
        *az=(float)(accel_databuff[2]) - calibration_value_accel[2];


    return res;
}

void MPU6050_Calibration(float aacx,float aacy,float aacz,short gyrox,short gyroy,short gyroz)//mpu6050校正函数
{
  static uint16_t Calibration_times=0; 
  if(Calibration_times > 300)return;
  /*mpu6050数据校准*/
  volatile static float buffer_angle[3]={0};
  volatile static int16_t buffer_gyro[3]={0};
  volatile static int16_t buffer_accel[3]={0};
  if (Calibration_times > 100 && Calibration_times <= 300)
  {

    buffer_gyro[0] += gyrox;
    buffer_gyro[1] += gyroy;
    buffer_gyro[2] += gyroz;

    buffer_angle[0] += Pitch;
    buffer_angle[1] += Roll;
    buffer_angle[2] += Yaw;
  }
  /*校准值计算*/
  if(Calibration_times==300)
  {
    calibration_value_gyro[0] = buffer_gyro[0] / 200;
    calibration_value_gyro[1] = buffer_gyro[1] / 200;
    calibration_value_gyro[2] = buffer_gyro[2] / 200;

    calibration_value_angle[0] = buffer_angle[0] / 200.0;
    calibration_value_angle[1] = buffer_angle[1] / 200.0;
    calibration_value_angle[2] = buffer_angle[2] / 200.0;

    calibration_value_accel[0] = Aacx;
    calibration_value_accel[1] = Aacy;
    calibration_value_accel[2] = Aacz;

    printf("MPU6050 data calibration finished\r\n");
  }
  Calibration_times++;
}



















